<html>
<head>
<title>C&eacute;lulas Virtuais :: Ajuda</title>
<meta http-equiv="imagetoolbar" content="no" />
<link rel="stylesheet" type="text/css" href="celulas.css" />
<style media="screen" type="text/css">
	a:link, a:visited {text-decoration: none; color: #00F}
	a:hover {text-decoration: underline; color: #00F}
	p {text-indent: 36px}
	.topico {font-weight: bold; color: #0f0; text-indent: 0}
</style>
</head>

<body>
<a name="menu"></a>
<p class="topico">::  Menu ::</p>
<p>Clique na op&ccedil;&atilde;o de seu interesse:</p>
  1) <a href="#top1">Introdu&ccedil;&atilde;o</a><br>
  2) <a href="#top2">Considera&ccedil;&otilde;es a respeito desta vers&atilde;o</a><br>
  3) <a href="#top3">Requerimentos m&iacute;nimos</a><br>
  4) <a href="#top4">A navega&ccedil;&atilde;o</a><br />
  <br>
  <br>
<a name="top1"></a>
<p class="topico"> :: 1) Introdu&ccedil;&atilde;o :: <a href="#menu">[Menu]</a></p>
<p> &quot;C&eacute;lulas Virtuais&quot; &eacute; um software educacional que objetiva o complemento do ensino de biologia celular a alunos do ensino fundamental. Em sua primeira vers&atilde;o procurou-se exigir o m&iacute;nimo de leitura diante do computador, o que pode se tornar cansativo e desestimulante. Dessa forma grande parte do conte&uacute;do escrito foi substitu&iacute;do por narra&ccedil;&otilde;es.</p>
<p>As imagens e anima&ccedil;&otilde;es geradas s&atilde;o esquem&aacute;ticas, visando uma abordagem mais did&aacute;tica.</p>
<p>Tamb&eacute;m se procurou incentivar a utiliza&ccedil;&atilde;o do programa pelo aluno ao criar um ambiente semelhante a um jogo durante a resolu&ccedil;&atilde;o de exerc&iacute;cios, onde a cada exerc&iacute;cio resolvido corretamente o aluno vai acumulando pontos. Ao entrar no programa solicita o nome do usu&aacute;rio, ao sair o nome fornecido &eacute; utilizado para o tratamento pessoal do usu&aacute;rio. Ainda ao sair do programa o us&uacute;ario fica sabendo a pontua&ccedil;&atilde;o atingida.</p>
<p>O programa &eacute; todo baseado em liga&ccedil;&otilde;es, possibilitando ao aluno desenvolver sua utiliza&ccedil;&atilde;o de forma n&atilde;o linear (pr&eacute;-estabelecida). Essas liga&ccedil;&otilde;es podem conduzir a textos, imagens, sons e v&iacute;deos que possuem rela&ccedil;&atilde;o com o item anterior. Geralmente os componentes que possuem liga&ccedil;&otilde;es s&atilde;o facilmente identificadas por se apresentarem de alguma forma destacadas (atrav&eacute;s da cor, sensibilidade ao passar do mouse, forma de bot&otilde;es, figuras sugestivas, etc). </p>
<br>
<br>
<a name="top2"></a>
<p class="topico"> :: 2) Considera&ccedil;&otilde;es a respeito desta vers&atilde;o :: <a href="#menu">[Menu]</a></p>
<p>Dentre os diversos tipos celulares que podem ser encontrados nos organismos vivos a vers&atilde;o 1.5 de &quot;C&eacute;lulas Virtuais&quot; limita-se apenas as c&eacute;lulas eucari&oacute;ticas animais, eucari&oacute;ticas vegetais e procari&oacute;ticas. Outros tipos celulares mais espec&iacute;ficos poder&atilde;o ser inclu&iacute;dos em vers&otilde;es futuras.</p>
<br>
<br>
<a name="top3"></a>
<p class="topico">:: 3) Requerimentos m&iacute;nimos :: <a href="#menu">[Menu]</a></p>
<p>&quot;C&eacute;lulas Virtuais&quot; necessita de um computador com CD-ROM, Kit Multim&iacute;dia e um navegador compat&iacute;vel com o Microsoft Internet Explorer &reg; ou com o Netscape Communicator &reg; (como o Mozilla Firefox &reg;), com suporte a Javascript Ativado e plugin QuickTime ou RealPlayer (RealOne). </p>
<br>
<br>
<a name="top4"></a>
<p class="topico">:: 4) A navega&ccedil;&atilde;o :: <a href="#menu">[Menu]</a></p>
<p> Navega&ccedil;&atilde;o &eacute; o termo que se usa para designar a migra&ccedil;&atilde;o entre documentos ou p&aacute;ginas atrav&eacute;s liga&ccedil;&otilde;es (hipertexto ou hiperm&iacute;dia).<br>
Atrav&eacute;s da navega&ccedil;&atilde;o &eacute; poss&iacute;vel para o usu&aacute;rio seguir uma seq&uuml;&ecirc;ncia, um roteiro, que ser&aacute; montada de acordo com seu interesse e necessidades. Nesse programa em espec&iacute;fico a navega&ccedil;&atilde;o acontece ao clicar sobre uma imagem (ou por&ccedil;&atilde;o delimitada desta), palavras-chave, anima&ccedil;&otilde;es ou bot&otilde;es. Desses os mais freq&uuml;entes s&atilde;o os bot&otilde;es.</p>
</body>
</html>
